<html lang="en-US">
  <head>
    <title>PHP Test</title>
    <link rel="stylesheet" href="css/main.css">
  </head>
  <body>
<h1>Заголовок</h1>
    <h4>Заголовок поменьше.</h4>
    <!-- жээсть, ксс жоскииииииииииии, но легкий!!!--> 
    
   <!-- <p style="color: red">test, красный <b>текст, запись ксс через стиль</b></p> лушче проверьте как оно работает.-->

    <!-- немного с айди текста поработаем. Прикол в том что он должен быть особенный, его повторение приведёт к ошибке.  Но по факту браузер всё обработает. -->
<p id="text-in-p">я весёлый <i>очень</i> там балабалаба <b id="hui">лалалалалалададудадада</b></p>
<!-- думаю я понятно объяснил, теперь в ксс файл! -->
   <!-- ещё кое что ..-->
    <a href="#"><b id="href">там решётка поэтому она никуда не введёt.</b></a>
  
<?php 
// я хоть ии не впервые но попытаюсь написать что-то на пчп, но теперь.. что-то годное. 

// подключение основного файла пчп

require 'main.php';
?>
  <input text="text" placeholder="Введите">  
 <!-- см. вики для подробностей; гит хаб. -->
    <a href="https://github.com/Earthradrjw"><p id="github">гит хаб</p>
<!-- https://github.com/Earthradrjw-->
  </body>
</html> 