<html lang="en-US">
  <head>
    <title>PHP Test</title>
    <link rel="stylesheet" href="css/main.css">
  </head>
  <body>
<h1>Заголовок</h1>
    <h4>Заголовок поменьше.</h4>
    <!-- жээсть, ксс жоскииииииииииии, нр легкий!!!--> 
    
   <!-- <p style="color: red">test, красный <b>текст, запись ксс через стиль</b></p> лушчп проверьте как оно работает.-->


<?php 
// я хоть ии не впервые но попытаюсь написать что-то на пчп, но теперь.. что-то годное. 

// подключение основного файла пчп

require 'main.php';
?>
    
  </body>
</html> 